<a href="https://colab.research.google.com/github/A7sultan/Python-DA-ML-portfolio/blob/main/Homework1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Homework

In [ ]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Question 1-  Panads program to select the rows where the number of attempts in the examination is less than 2 and score greater than 15

In [ ]:
x=pd.DataFrame(exam_data, index=labels)
print(x[(x['attempts'] < 2) & (x['score'] > 15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Question 2- Pandas program to change the score in row 'd' to 11.5

In [ ]:
x=pd.DataFrame(exam_data)
x.loc['d', 'score'] = 11.5
print(x)

        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
2  Katherine   16.5       2.0     yes
3      James    NaN       3.0      no
4      Emily    9.0       2.0      no
5    Michael   20.0       3.0     yes
6    Matthew   14.5       1.0     yes
7      Laura    NaN       1.0      no
8      Kevin    8.0       2.0      no
9      Jonas   19.0       1.0     yes
d        NaN   11.5       NaN     NaN

To calculate the sum of the examination attempts by the student

In [ ]:
x=pd.DataFrame(exam_data)
print(x["attempts"].sum())

19

To calculate the mean score of each different student in dataframe

In [ ]:
y=x["score"].mean()
y

13.5625

to append a new row 'k' to data frame with given values for each column. now delete the new row and return the original Dataframe

In [ ]:
print("before appending:")
print(x)
print("appending a new row:")
x.loc['k']=['Daniel',16.2,1,'yes' ]
print("New Dataset:")
print(x)
print("Deleting the new row:")
x=x.drop('k')
print(x)

before appending:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
appending a new row:
New Dataset:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k     Daniel  16.2        1     yes
Deleting the new row:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

To sort the Dataframe first by name in descending order and then by score in ascending order.

In [ ]:
print("Orginal rows:")
print(x)
x= x.sort_values(by=['name', 'score'], ascending=[False, True])
print("Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:")
print(x)

Orginal rows:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:
        name score attempts qualify
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
c  Katherine  16.5        2     yes
j      Jonas  19.0        1     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
b       Dima   9.0        3      no
a  Anastasia  12.5        1     yes

To replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [ ]:
df = pd.DataFrame(exam_data , index=labels)
print("Original rows:")
print(df)
print("\nReplace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

Original rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:
        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

To change the name 'James' to 'Suresh' in the name column from the dataframe.

In [ ]:
df1 = pd.DataFrame(exam_data , index=labels)
print("\nChange the name 'James' to ‘Suresh’:")
df1['name'] = df1['name'].replace('James', 'Suresh')
print(df1)

Change the name 'James' to ‘Suresh’:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

To delete the attempts column from the dataframe.

In [ ]:
df2 = pd.DataFrame(exam_data , index=labels)
print("\nDelete the 'attempts' column from the data frame:")
df2.pop('attempts')
print(df2)

Delete the 'attempts' column from the data frame:
        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

To insert a new column in existing Dataframe

In [ ]:
df3 = pd.DataFrame(exam_data , index=labels)
subject = ['math','english','science','math','Chem','Chem','english','geography','geography','math']
df3['subject'] = subject
print("\nNew DataFrame after inserting the 'subject' column")
print(df3)

New DataFrame after inserting the 'subject' column
        name  score  attempts qualify    subject
a  Anastasia   12.5         1     yes       math
b       Dima    9.0         3      no    english
c  Katherine   16.5         2     yes    science
d      James    NaN         3      no       math
e      Emily    9.0         2      no       Chem
f    Michael   20.0         3     yes       Chem
g    Matthew   14.5         1     yes    english
h      Laura    NaN         1      no  geography
i      Kevin    8.0         2      no  geography
j      Jonas   19.0         1     yes       math

TO iterate over rows in Dataframe

In [ ]:
df4 = pd.DataFrame(exam_data)
for index, row in df4.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

To count the NaN values in one or more columns in Dataframe.

In [ ]:
df5= pd.DataFrame(exam_data)
print("\nNumber of NaN values in one or more columns:")
print(df5.isnull().values.sum())

Number of NaN values in one or more columns:
2

Make all column names to upper case

In [ ]:
a=pd.DataFrame(exam_data)
a['name']=a['name'].str.upper()
print(a)

        name  score  attempts qualify
0  ANASTASIA   12.5         1     yes
1       DIMA    9.0         3      no
2  KATHERINE   16.5         2     yes
3      JAMES    NaN         3      no
4      EMILY    9.0         2      no
5    MICHAEL   20.0         3     yes
6    MATTHEW   14.5         1     yes
7      LAURA    NaN         1      no
8      KEVIN    8.0         2      no
9      JONAS   19.0         1     yes

Add underscore to all the column names

In [ ]:
df= pd.DataFrame(exam_data)
df=df.rename(columns={"name":"name_","score":"score_","attempts":"attempts_","qualify":"qualify_"})
print(df)

       name_  score_  attempts_ qualify_
0  Anastasia    12.5          1      yes
1       Dima     9.0          3       no
2  Katherine    16.5          2      yes
3      James     NaN          3       no
4      Emily     9.0          2       no
5    Michael    20.0          3      yes
6    Matthew    14.5          1      yes
7      Laura     NaN          1       no
8      Kevin     8.0          2       no
9      Jonas    19.0          1      yes